examples/rsimulator-example-unittest/src/main/resources/com/github/bjuvensjo/rsimulator/example/unittest/transfer/Account.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:tns="http://www.github.com/bjuvensjo/rsimulator/example/unittest/transfer/account/"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  name="Account" targetNamespace="http://www.github.com/bjuvensjo/rsimulator/example/unittest/transfer/account/">
    <wsdl:types>
        <xsd:schema
                targetNamespace="http://www.github.com/bjuvensjo/rsimulator/example/unittest/transfer/account/">
            <xsd:include schemaLocation="./Account.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="GetAccountsRequest">
        <wsdl:part element="tns:GetAccountsRequest" name="parameters"/>
    </wsdl:message>
    <wsdl:message name="GetAccountsResponse">
        <wsdl:part element="tns:GetAccountsResponse" name="parameters"/>
    </wsdl:message>
    <wsdl:portType name="AccountPort">
        <wsdl:operation name="GetAccounts">
            <wsdl:input message="tns:GetAccountsRequest"/>
            <wsdl:output message="tns:GetAccountsResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="AccountSOAP" type="tns:AccountPort">
        <soap:binding style="document"
                      transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="GetAccounts">
            <soap:operation
                    soapAction="http://www.github.com/bjuvensjo/rsimulator/example/unittest/transfer/account/GetAccounts"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="AccountService">
        <wsdl:port binding="tns:AccountSOAP" name="AccountSOAP">
            <soap:address location="http://localhost:8080/"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
